zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_SAI.h
#define SAI_TCR5_W0W_MASK                        (0x1F0000U)
#define SAI_TCR5_W0W_SHIFT                       (16U)
#define SAI_TCR5_W0W_WIDTH                       (5U)
#define SAI_TCR5_W0W(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR5_W0W_SHIFT)) & SAI_TCR5_W0W_MASK)

#define SAI_TCR5_WNW_MASK                        (0x1F000000U)
#define SAI_TCR5_WNW_SHIFT                       (24U)
#define SAI_TCR5_WNW_WIDTH                       (5U)
#define SAI_TCR5_WNW(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR5_WNW_SHIFT)) & SAI_TCR5_WNW_MASK)
/*! @} */

/*! @name TDR - Transmit Data */
/*! @{ */

#define SAI_TDR_TDR_MASK                         (0xFFFFFFFFU)
#define SAI_TDR_TDR_SHIFT                        (0U)
#define SAI_TDR_TDR_WIDTH                        (32U)
#define SAI_TDR_TDR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TDR_TDR_SHIFT)) & SAI_TDR_TDR_MASK)
/*! @} */

/*! @name TFR - Transmit FIFO */
/*! @{ */

#define SAI_TFR_RFP_MASK                         (0xFU)
#define SAI_TFR_RFP_SHIFT                        (0U)
#define SAI_TFR_RFP_WIDTH                        (4U)
#define SAI_TFR_RFP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TFR_RFP_SHIFT)) & SAI_TFR_RFP_MASK)

#define SAI_TFR_WFP_MASK                         (0xF0000U)
#define SAI_TFR_WFP_SHIFT                        (16U)
#define SAI_TFR_WFP_WIDTH                        (4U)
#define SAI_TFR_WFP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TFR_WFP_SHIFT)) & SAI_TFR_WFP_MASK)

#define SAI_TFR_WCP_MASK                         (0x80000000U)
#define SAI_TFR_WCP_SHIFT                        (31U)
#define SAI_TFR_WCP_WIDTH                        (1U)
#define SAI_TFR_WCP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TFR_WCP_SHIFT)) & SAI_TFR_WCP_MASK)
/*! @} */

/*! @name TMR - Transmit Mask */
/*! @{ */

#define SAI_TMR_TWM_MASK                         (0xFFFFU)
#define SAI_TMR_TWM_SHIFT                        (0U)
#define SAI_TMR_TWM_WIDTH                        (16U)
#define SAI_TMR_TWM(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TMR_TWM_SHIFT)) & SAI_TMR_TWM_MASK)
/*! @} */

/*! @name RCSR - Receive Control */
/*! @{ */

#define SAI_RCSR_FRDE_MASK                       (0x1U)
#define SAI_RCSR_FRDE_SHIFT                      (0U)
#define SAI_RCSR_FRDE_WIDTH                      (1U)
#define SAI_RCSR_FRDE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRDE_SHIFT)) & SAI_RCSR_FRDE_MASK)

#define SAI_RCSR_FWDE_MASK                       (0x2U)
#define SAI_RCSR_FWDE_SHIFT                      (1U)
#define SAI_RCSR_FWDE_WIDTH                      (1U)
#define SAI_RCSR_FWDE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWDE_SHIFT)) & SAI_RCSR_FWDE_MASK)

#define SAI_RCSR_FRIE_MASK                       (0x100U)
#define SAI_RCSR_FRIE_SHIFT                      (8U)
#define SAI_RCSR_FRIE_WIDTH                      (1U)
#define SAI_RCSR_FRIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRIE_SHIFT)) & SAI_RCSR_FRIE_MASK)

#define SAI_RCSR_FWIE_MASK                       (0x200U)
#define SAI_RCSR_FWIE_SHIFT                      (9U)
#define SAI_RCSR_FWIE_WIDTH                      (1U)
#define SAI_RCSR_FWIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWIE_SHIFT)) & SAI_RCSR_FWIE_MASK)

#define SAI_RCSR_FEIE_MASK                       (0x400U)
#define SAI_RCSR_FEIE_SHIFT                      (10U)
#define SAI_RCSR_FEIE_WIDTH                      (1U)
#define SAI_RCSR_FEIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FEIE_SHIFT)) & SAI_RCSR_FEIE_MASK)

#define SAI_RCSR_SEIE_MASK                       (0x800U)
#define SAI_RCSR_SEIE_SHIFT                      (11U)
#define SAI_RCSR_SEIE_WIDTH                      (1U)
#define SAI_RCSR_SEIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SEIE_SHIFT)) & SAI_RCSR_SEIE_MASK)

#define SAI_RCSR_WSIE_MASK                       (0x1000U)
#define SAI_RCSR_WSIE_SHIFT                      (12U)
#define SAI_RCSR_WSIE_WIDTH                      (1U)
#define SAI_RCSR_WSIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_WSIE_SHIFT)) & SAI_RCSR_WSIE_MASK)

#define SAI_RCSR_FRF_MASK                        (0x10000U)
#define SAI_RCSR_FRF_SHIFT                       (16U)
#define SAI_RCSR_FRF_WIDTH                       (1U)
#define SAI_RCSR_FRF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRF_SHIFT)) & SAI_RCSR_FRF_MASK)

#define SAI_RCSR_FWF_MASK                        (0x20000U)
#define SAI_RCSR_FWF_SHIFT                       (17U)
#define SAI_RCSR_FWF_WIDTH                       (1U)
#define SAI_RCSR_FWF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWF_SHIFT)) & SAI_RCSR_FWF_MASK)

#define SAI_RCSR_FEF_MASK                        (0x40000U)
#define SAI_RCSR_FEF_SHIFT                       (18U)
#define SAI_RCSR_FEF_WIDTH                       (1U)
#define SAI_RCSR_FEF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FEF_SHIFT)) & SAI_RCSR_FEF_MASK)

#define SAI_RCSR_SEF_MASK                        (0x80000U)
#define SAI_RCSR_SEF_SHIFT                       (19U)
#define SAI_RCSR_SEF_WIDTH                       (1U)
#define SAI_RCSR_SEF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SEF_SHIFT)) & SAI_RCSR_SEF_MASK)

#define SAI_RCSR_WSF_MASK                        (0x100000U)
#define SAI_RCSR_WSF_SHIFT                       (20U)
#define SAI_RCSR_WSF_WIDTH                       (1U)
#define SAI_RCSR_WSF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_WSF_SHIFT)) & SAI_RCSR_WSF_MASK)

#define SAI_RCSR_SR_MASK                         (0x1000000U)
#define SAI_RCSR_SR_SHIFT                        (24U)
#define SAI_RCSR_SR_WIDTH                        (1U)
#define SAI_RCSR_SR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SR_SHIFT)) & SAI_RCSR_SR_MASK)

#define SAI_RCSR_FR_MASK                         (0x2000000U)
#define SAI_RCSR_FR_SHIFT                        (25U)
#define SAI_RCSR_FR_WIDTH                        (1U)
#define SAI_RCSR_FR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FR_SHIFT)) & SAI_RCSR_FR_MASK)

#define SAI_RCSR_BCE_MASK                        (0x10000000U)
#define SAI_RCSR_BCE_SHIFT                       (28U)
#define SAI_RCSR_BCE_WIDTH                       (1U)
#define SAI_RCSR_BCE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_BCE_SHIFT)) & SAI_RCSR_BCE_MASK)

#define SAI_RCSR_DBGE_MASK                       (0x20000000U)
#define SAI_RCSR_DBGE_SHIFT                      (29U)
#define SAI_RCSR_DBGE_WIDTH                      (1U)
#define SAI_RCSR_DBGE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_DBGE_SHIFT)) & SAI_RCSR_DBGE_MASK)

#define SAI_RCSR_RE_MASK                         (0x80000000U)
#define SAI_RCSR_RE_SHIFT                        (31U)
#define SAI_RCSR_RE_WIDTH                        (1U)
#define SAI_RCSR_RE(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_RE_SHIFT)) & SAI_RCSR_RE_MASK)
/*! @} */

/*! @name RCR1 - Receive Configuration 1 */
/*! @{ */

